In [1]:
# Code from 
import pandas as pd

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/lazyprogrammer/machine_learning_examples/master/tf2.0/sbux.csv')

In [6]:
def date_to_year(row):
    return int(row['date'].split('-')[0])

In [7]:
date_to_year(df.iloc[0])

2013

In [9]:
df.apply(date_to_year, axis=1)

0       2013
1       2013
2       2013
3       2013
4       2013
        ...
1254    2018
1255    2018
1256    2018
1257    2018
1258    2018
Length: 1259, dtype: int64

In [10]:
df['year'] = df.apply(date_to_year, axis=1)

In [12]:
df.head()

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>date</th>
      <th>open</th>
      <th>high</th>
      <th>low</th>
      <th>close</th>
      <th>volume</th>
      <th>Name</th>
      <th>year</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>0</td>
      <td>2013-02-08</td>
      <td>27.920</td>
      <td>28.325</td>
      <td>27.920</td>
      <td>28.185</td>
      <td>7146296</td>
      <td>SBUX</td>
      <td>2013</td>
    </tr>
    <tr>
      <td>1</td>
      <td>2013-02-11</td>
      <td>28.260</td>
      <td>28.260</td>
      <td>27.930</td>
      <td>28.070</td>
      <td>5457354</td>
      <td>SBUX</td>
      <td>2013</td>
    </tr>
    <tr>
      <td>2</td>
      <td>2013-02-12</td>
      <td>28.000</td>
      <td>28.275</td>
      <td>27.975</td>
      <td>28.130</td>
      <td>8665592</td>
      <td>SBUX</td>
      <td>2013</td>
    </tr>
    <tr>
      <td>3</td>
      <td>2013-02-13</td>
      <td>28.230</td>
      <td>28.230</td>
      <td>27.750</td>
      <td>27.915</td>
      <td>7022056</td>
      <td>SBUX</td>
      <td>2013</td>
    </tr>
    <tr>
      <td>4</td>
      <td>2013-02-14</td>
      <td>27.765</td>
      <td>27.905</td>
      <td>27.675</td>
      <td>27.775</td>
      <td>8899188</td>
      <td>SBUX</td>
      <td>2013</td>
    </tr>
  </tbody>
</table>
</div>